2zzyyyq/3C/n32g033_std_periph_driver/inc/n32g033_hdiv.h
/**
*     Copyright (c) 2025, Nsing Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nsing Technologies Inc. (Hereinafter 
* referred to as Nsing). This software, and the product of Nsing described herein 
* (Hereinafter referred to as the Product) are owned by Nsing under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     Nsing does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     Nsing reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact Nsing and obtain 
* the latest version of this software before placing orders.

*     Although Nsing has attempted to provide accurate and reliable information, Nsing assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall Nsing be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     Nsing Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify Nsing and hold Nsing 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by Nsing, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     Nsing products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/


/**
*\*\file n32g033_hdiv.h
*\*\author Nsing
*\*\version v1.0.0
*\*\copyright Copyright (c) 2025, Nsing Technologies Inc. All rights reserved.
**/
#ifndef __N32G033_HDIV_H__
#define __N32G033_HDIV_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g033.h"

/* HDIV bus hold */
#define HDIV_BUSHOLDEN  (HDIV_CTRLSTS_HDIVBUSHOLD)

/* auto start of HDIV calculating */
#define HDIV_AUTOSTARTCAL  (HDIV_CTRLSTS_HDIVAUTOSTART)

/* calculated number is signed or unsigned */
#define HDIV_SIGNDATAEN  (HDIV_CTRLSTS_HDIVTYPESEL)

/* HDIVSTART */
#define HDIV_START_ENABLE  (HDIV_CTRLSTS_HDIVSTART)

/* HDIV_Flag */
#define HDIV_FLAG_DF      ((uint32_t)HDIV_CTRLSTS_HDIVDF)
#define HDIV_FLAG_DIVBY0  ((uint32_t)HDIV_DIVBY0_DIVBY0)


/** HDIV_Exported_Functions **/
void HDIV_ConfigBusHold(FunctionalState Cmd);
void HDIV_ConfigAutoStart(FunctionalState Cmd);
void HDIV_ConfigDataType(FunctionalState Cmd);
FlagStatus HDIV_GetFlagStatus(uint32_t HDIV_FLAG);
void HDIV_SetUnsignedDIVIDEND_Data(uint32_t data);
uint32_t HDIV_GetUnsignedDIVIDEND_Data(void);
void HDIV_SetUnsignedDIVISOR_Data(uint32_t data);
uint32_t HDIV_GetUnsignedDIVISOR_Data(void);
uint32_t HDIV_GetUnsignedQUOTIENT_Data(void);
uint32_t HDIV_GetUnsignedREMAINDER_Data(void);
void HDIV_ConfigSingleStart(void);
void HDIV_Enable(FunctionalState Cmd);
void HDIV_SetSignedDIVIDEND_Data(int32_t data);
void HDIV_SetSignedDIVISOR_Data(int32_t data);
int32_t HDIV_GetSignedDIVIDEND_Data(void);
int32_t HDIV_GetSignedDIVISOR_Data(void);
int32_t HDIV_GetSignedQUOTIENT_Data(void);
int32_t HDIV_GetSignedREMAINDER_Data(void);

#ifdef __cplusplus
}
#endif

#endif /* __N32G033_HDIV_H__ */

